{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Основы программирования в Python\n",
    "\n",
    "*Алла Тамбовцева*\n",
    "\n",
    "## Дополнительные задачи"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача 1\n",
    "Напишите программу, которая выбирает первый пример из списка `exer` и предлагает пользователю его решить. Если решение верное, то на экран выводится сообщение \"Верно!\" и программа предлагает пользователю решить следующий пример, если решение неверное, то на экран выводится сообщение \"Попробуйте еще раз!\" и программа предлагает пользователю решить тот же пример. Когда пользователь предлагает верное решение последнего примера, программа выводит на экран сообщение \"Вы решили все примеры! Идите пить чай!\" и останавливается.\n",
    "\n",
    "Список `exer`:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "exer = [\"4^2+3*8\", \"25+4^3*5\", \"36^0.5+12\", \"34-12*3^2\", \"2^3+16^0.5-1\", \"8*0-2^8\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Подсказка:** создайте список ответов на примеры, а затем словарь соотвествий.\n",
    "\n",
    "**Пример работы программы:**\n",
    "\n",
    "    Решите пример \n",
    "\n",
    "    34-12*4^2\n",
    "    -74\n",
    "    Верно! \n",
    "\n",
    "    Решите пример \n",
    "\n",
    "    8*0-2^8\n",
    "    0\n",
    "    Попробуйте еще раз! \n",
    "\n",
    "    -256\n",
    "    Верно! \n",
    "\n",
    "    Решите пример \n",
    "\n",
    "    25+4^3*5\n",
    "    345\n",
    "    Верно! \n",
    "\n",
    "    Решите пример \n",
    "\n",
    "    4^2+3*8\n",
    "    7\n",
    "    Попробуйте еще раз! \n",
    "\n",
    "    40\n",
    "    Верно! \n",
    "\n",
    "    Решите пример \n",
    "\n",
    "    36^0.5+12\n",
    "    18\n",
    "    Верно! \n",
    "\n",
    "    Решите пример \n",
    "\n",
    "    2^3+16^0.5-1\n",
    "    11\n",
    "    Верно! \n",
    "\n",
    "    Вы решили все примеры! Идите пить чай!"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача 2\n",
    "\n",
    "*Поле чудес (почти)*\n",
    "\n",
    "Напишите программу-игру, которая делает следующее: загадывает слово и просит пользователя угадать его по первой и последней букве (\"скелет\" слова выводится на экран). Если пользователь угадал слово, на экран выводится сообщение \"Так держать!\", если нет ‒ сообщение вида \"Подсказка: \" и слово с двумя первыми буквами. Если пользователь опять не угадывает, выводится сообщение вида \"Подсказка: \" и слово с тремя первыми буквами и так далее, до тех пор, пока пользователь не угадает слово.\n",
    "\n",
    "Для удобства приведен код, который залезает в txt-файл, в котором хранятся слова (каждое с новой строки), составляет из этих слов список и выбирает из них случайное. Скачайте файл и сохраните его в ту же папку, что и текущий ноутбук (иначе Python не найдет файл и выдаст ошибку `No such file or directory`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# список слов из файла words.txt\n",
    "word_list = []\n",
    "with open('words.txt') as f:  # or whatever the wordlist is saved as\n",
    "    for line in f.readlines():\n",
    "        word_list.append(line.strip())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'словарь'"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# выбор случайного слова - используйте вторую строчку для выбора слова\n",
    "from random import choice\n",
    "rword = choice(word_list)\n",
    "rword"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Пример работы программы:**\n",
    "\n",
    "*Пример 1:*\n",
    "\n",
    "    Угадайте слово: в _  _  _ а\n",
    "    Введите слово: вилка\n",
    "    Подсказка: вы _  _ а\n",
    "    Введите слово: вышка\n",
    "    Так держать!\n",
    "\n",
    "*Пример 2:*\n",
    "\n",
    "    Угадайте слово: с _  _  _  _ я\n",
    "    Введите слово: сессия\n",
    "    Так держать!\n",
    "\n",
    "*Пример 3:*\n",
    "\n",
    "    Угадайте слово: с _  _  _  _  _ ь\n",
    "    Введите слово: сырость\n",
    "    Подсказка: сл _  _  _  _ ь\n",
    "    Введите слово: слякоть\n",
    "    Подсказка: сло _  _  _ ь\n",
    "    Введите слово: словарь\n",
    "    Так держать!"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача 3\n",
    "\n",
    "*Вредный таймер*\n",
    "\n",
    "Представьте, что ваша программа умеет воспроизодить музыкальные композиции (Python [умеет]() работать с медиа-файлами, но это не очень просто, поэтому давайте заменим звонок на `print(\"LALALA)`).\n",
    "\n",
    "Напишите программу, которая будет «играть» мелодию каждую минуту, пока пользователь не «выключит» ее. При этом она будет выводить на экран сообщение `Sorry, I will sing again!`. Чтобы «выключить программу», нужно трижды ввести \"Ах, цветут каштаны на Елисейских полях!\". Когда программа остановится, она должна вывести сообщение `STOP`.\n",
    "\n",
    "*Подсказка:* чтобы выставить задержку по времени, можно импортировать функцию `sleep` из модуля `time`:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n",
      "1\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "from time import sleep\n",
    "\n",
    "for i in range(3):\n",
    "    sleep(5)\n",
    "    print(i)\n",
    "     # ждать 5 секунд прежде чем вывести i на экран"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Пример работы программы:**\n",
    "\n",
    "    LALALA\n",
    "    воочт\n",
    "    что\n",
    "    ах\n",
    "    Sorry, I will sing again!\n",
    "    LALALA\n",
    "    Ах, цветут каштаны на Елисейских полях!\n",
    "    Ах, цветут каштаны на Елисейских полях!\n",
    "    Ах, цветут каштаны на Елисейских полях!\n",
    "    STOP"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
